"""
Используйте словарь для сохранения информации об известном вам человеке. Сохраните 
данные о его имени и фамилии, возрасте и городе в котором он живет. Сорварь должен 
содержать ключи с такими именами, как 'first_name', 'last_name', 'age' и 'city'.
Выведите каждый фрагмент информации, хранящийся в словаре.
"""

person = {
  'first_name': 'John',
  'last_name': 'Doe',
  'age': 30,
  'city': 'New York'
}

print(person['first_name'])
print(person['last_name'])
print(person['age'])
print(person['city'])